app/controllers/pantry_controller.rb

  def index
    render json: Pantry.all
---
SELECT "pantries".* FROM "pantries"

  def show
    render json: Pantry.find(params[:id])
---
SELECT  "pantries".* FROM "pantries" WHERE "pantries"."id" = ? LIMIT 1  [["id", 1]]